QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB28def.inc
; ADC_INTFLAGS masks
; Masks for ADC_RESRDY already defined
; Masks for ADC_SAMPRDY already defined
; Masks for ADC_WCMP already defined
; Masks for ADC_RESOVR already defined
; Masks for ADC_SAMPOVR already defined
; Masks for ADC_TRIGOVR already defined

; ADC_STATUS masks
.equ ADC_ADCBUSY_bm = 0x01               ; ADC Busy bit mask
.equ ADC_ADCBUSY_bp = 0                  ; ADC Busy bit position

; ADC_DBGCTRL masks
.equ ADC_DBGRUN_bm = 0x01                ; Run in Debug Mode bit mask
.equ ADC_DBGRUN_bp = 0                   ; Run in Debug Mode bit position

; ADC_CTRLE masks
.equ ADC_SAMPDUR_gm = 0xFF               ; Sample Duration group mask
.equ ADC_SAMPDUR_gp = 0                  ; Sample Duration group position
.equ ADC_SAMPDUR_0_bm = (1<<0)           ; Sample Duration bit 0 mask
.equ ADC_SAMPDUR_0_bp = 0                ; Sample Duration bit 0 position
.equ ADC_SAMPDUR_1_bm = (1<<1)           ; Sample Duration bit 1 mask
.equ ADC_SAMPDUR_1_bp = 1                ; Sample Duration bit 1 position
.equ ADC_SAMPDUR_2_bm = (1<<2)           ; Sample Duration bit 2 mask
.equ ADC_SAMPDUR_2_bp = 2                ; Sample Duration bit 2 position
.equ ADC_SAMPDUR_3_bm = (1<<3)           ; Sample Duration bit 3 mask
.equ ADC_SAMPDUR_3_bp = 3                ; Sample Duration bit 3 position
.equ ADC_SAMPDUR_4_bm = (1<<4)           ; Sample Duration bit 4 mask
.equ ADC_SAMPDUR_4_bp = 4                ; Sample Duration bit 4 position
.equ ADC_SAMPDUR_5_bm = (1<<5)           ; Sample Duration bit 5 mask
.equ ADC_SAMPDUR_5_bp = 5                ; Sample Duration bit 5 position
.equ ADC_SAMPDUR_6_bm = (1<<6)           ; Sample Duration bit 6 mask
.equ ADC_SAMPDUR_6_bp = 6                ; Sample Duration bit 6 position
.equ ADC_SAMPDUR_7_bm = (1<<7)           ; Sample Duration bit 7 mask
.equ ADC_SAMPDUR_7_bp = 7                ; Sample Duration bit 7 position

; ADC_CTRLF masks
.equ ADC_SAMPNUM_gm = 0x0F               ; Sample numbers group mask
.equ ADC_SAMPNUM_gp = 0                  ; Sample numbers group position
.equ ADC_SAMPNUM_0_bm = (1<<0)           ; Sample numbers bit 0 mask
.equ ADC_SAMPNUM_0_bp = 0                ; Sample numbers bit 0 position
.equ ADC_SAMPNUM_1_bm = (1<<1)           ; Sample numbers bit 1 mask
.equ ADC_SAMPNUM_1_bp = 1                ; Sample numbers bit 1 position
.equ ADC_SAMPNUM_2_bm = (1<<2)           ; Sample numbers bit 2 mask
.equ ADC_SAMPNUM_2_bp = 2                ; Sample numbers bit 2 position
.equ ADC_SAMPNUM_3_bm = (1<<3)           ; Sample numbers bit 3 mask
.equ ADC_SAMPNUM_3_bp = 3                ; Sample numbers bit 3 position
.equ ADC_LEFTADJ_bm = 0x10               ; Left Adjust bit mask
.equ ADC_LEFTADJ_bp = 4                  ; Left Adjust bit position
.equ ADC_FREERUN_bm = 0x20               ; Free-Running mode bit mask
.equ ADC_FREERUN_bp = 5                  ; Free-Running mode bit position
.equ ADC_CHOPPING_bm = 0x40              ; Sign Chopping bit mask
.equ ADC_CHOPPING_bp = 6                 ; Sign Chopping bit position

; ADC_COMMAND masks
.equ ADC_START_gm = 0x07                 ; Start command group mask
.equ ADC_START_gp = 0                    ; Start command group position
.equ ADC_START_0_bm = (1<<0)             ; Start command bit 0 mask
.equ ADC_START_0_bp = 0                  ; Start command bit 0 position
.equ ADC_START_1_bm = (1<<1)             ; Start command bit 1 mask
.equ ADC_START_1_bp = 1                  ; Start command bit 1 position
.equ ADC_START_2_bm = (1<<2)             ; Start command bit 2 mask
.equ ADC_START_2_bp = 2                  ; Start command bit 2 position
.equ ADC_MODE_gm = 0x70                  ; Mode group mask
.equ ADC_MODE_gp = 4                     ; Mode group position
.equ ADC_MODE_0_bm = (1<<4)              ; Mode bit 0 mask
.equ ADC_MODE_0_bp = 4                   ; Mode bit 0 position
.equ ADC_MODE_1_bm = (1<<5)              ; Mode bit 1 mask
.equ ADC_MODE_1_bp = 5                   ; Mode bit 1 position
.equ ADC_MODE_2_bm = (1<<6)              ; Mode bit 2 mask
.equ ADC_MODE_2_bp = 6                   ; Mode bit 2 position
.equ ADC_DIFF_bm = 0x80                  ; Differential mode bit mask
.equ ADC_DIFF_bp = 7                     ; Differential mode bit position

; ADC_PGACTRL masks
.equ ADC_PGAEN_bm = 0x01                 ; PGA Enable bit mask
.equ ADC_PGAEN_bp = 0                    ; PGA Enable bit position
.equ ADC_PGABIASSEL_gm = 0x18            ; PGA BIAS Select group mask
.equ ADC_PGABIASSEL_gp = 3               ; PGA BIAS Select group position
.equ ADC_PGABIASSEL_0_bm = (1<<3)        ; PGA BIAS Select bit 0 mask
.equ ADC_PGABIASSEL_0_bp = 3             ; PGA BIAS Select bit 0 position
.equ ADC_PGABIASSEL_1_bm = (1<<4)        ; PGA BIAS Select bit 1 mask
.equ ADC_PGABIASSEL_1_bp = 4             ; PGA BIAS Select bit 1 position
.equ ADC_GAIN_gm = 0xE0                  ; Gain group mask
.equ ADC_GAIN_gp = 5                     ; Gain group position
.equ ADC_GAIN_0_bm = (1<<5)              ; Gain bit 0 mask
.equ ADC_GAIN_0_bp = 5                   ; Gain bit 0 position
.equ ADC_GAIN_1_bm = (1<<6)              ; Gain bit 1 mask
.equ ADC_GAIN_1_bp = 6                   ; Gain bit 1 position
.equ ADC_GAIN_2_bm = (1<<7)              ; Gain bit 2 mask
.equ ADC_GAIN_2_bp = 7                   ; Gain bit 2 position

; ADC_MUXPOS masks
.equ ADC_MUXPOS_gm = 0x3F                ; Analog Channel Selection Bits group mask
.equ ADC_MUXPOS_gp = 0                   ; Analog Channel Selection Bits group position
.equ ADC_MUXPOS_0_bm = (1<<0)            ; Analog Channel Selection Bits bit 0 mask
.equ ADC_MUXPOS_0_bp = 0                 ; Analog Channel Selection Bits bit 0 position
.equ ADC_MUXPOS_1_bm = (1<<1)            ; Analog Channel Selection Bits bit 1 mask
.equ ADC_MUXPOS_1_bp = 1                 ; Analog Channel Selection Bits bit 1 position
.equ ADC_MUXPOS_2_bm = (1<<2)            ; Analog Channel Selection Bits bit 2 mask
.equ ADC_MUXPOS_2_bp = 2                 ; Analog Channel Selection Bits bit 2 position
.equ ADC_MUXPOS_3_bm = (1<<3)            ; Analog Channel Selection Bits bit 3 mask
.equ ADC_MUXPOS_3_bp = 3                 ; Analog Channel Selection Bits bit 3 position
.equ ADC_MUXPOS_4_bm = (1<<4)            ; Analog Channel Selection Bits bit 4 mask
.equ ADC_MUXPOS_4_bp = 4                 ; Analog Channel Selection Bits bit 4 position
.equ ADC_MUXPOS_5_bm = (1<<5)            ; Analog Channel Selection Bits bit 5 mask
.equ ADC_MUXPOS_5_bp = 5                 ; Analog Channel Selection Bits bit 5 position
.equ ADC_VIA_gm = 0xC0                   ; VIA group mask
.equ ADC_VIA_gp = 6                      ; VIA group position
.equ ADC_VIA_0_bm = (1<<6)               ; VIA bit 0 mask
.equ ADC_VIA_0_bp = 6                    ; VIA bit 0 position
.equ ADC_VIA_1_bm = (1<<7)               ; VIA bit 1 mask
.equ ADC_VIA_1_bp = 7                    ; VIA bit 1 position

; ADC_MUXNEG masks
.equ ADC_MUXNEG_gm = 0x3F                ; Analog Channel Selection Bits group mask
.equ ADC_MUXNEG_gp = 0                   ; Analog Channel Selection Bits group position
.equ ADC_MUXNEG_0_bm = (1<<0)            ; Analog Channel Selection Bits bit 0 mask
.equ ADC_MUXNEG_0_bp = 0                 ; Analog Channel Selection Bits bit 0 position
.equ ADC_MUXNEG_1_bm = (1<<1)            ; Analog Channel Selection Bits bit 1 mask
.equ ADC_MUXNEG_1_bp = 1                 ; Analog Channel Selection Bits bit 1 position
.equ ADC_MUXNEG_2_bm = (1<<2)            ; Analog Channel Selection Bits bit 2 mask
.equ ADC_MUXNEG_2_bp = 2                 ; Analog Channel Selection Bits bit 2 position
.equ ADC_MUXNEG_3_bm = (1<<3)            ; Analog Channel Selection Bits bit 3 mask
.equ ADC_MUXNEG_3_bp = 3                 ; Analog Channel Selection Bits bit 3 position
.equ ADC_MUXNEG_4_bm = (1<<4)            ; Analog Channel Selection Bits bit 4 mask
.equ ADC_MUXNEG_4_bp = 4                 ; Analog Channel Selection Bits bit 4 position
.equ ADC_MUXNEG_5_bm = (1<<5)            ; Analog Channel Selection Bits bit 5 mask
.equ ADC_MUXNEG_5_bp = 5                 ; Analog Channel Selection Bits bit 5 position
; Masks for ADC_VIA already defined

; Mode select
.equ ADC_MODE_SINGLE_8BIT_gc = (0x00<<4) ; Single Conversion with 8-bit resolution
.equ ADC_MODE_SINGLE_12BIT_gc = (0x01<<4) ; Single Conversion with 12-bit resolution
.equ ADC_MODE_SERIES_gc = (0x02<<4)      ; Series with accumulation, separate trigger for every 12-bit conversion
.equ ADC_MODE_SERIES_SCALING_gc = (0x03<<4) ; Series with accumulation and scaling, separate trigger for every 12-bit conversion
.equ ADC_MODE_BURST_gc = (0x04<<4)       ; Burst with accumulation, one trigger will run SAMPNUM 12-bit conversions
.equ ADC_MODE_BURST_SCALING_gc = (0x05<<4) ; Burst with accumulation and scaling, one trigger will run SAMPNUM 12-bit conversions

