QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB28def.inc
; CRCSCAN_CTRLA masks
.equ CRCSCAN_ENABLE_bm = 0x01            ; Enable CRC scan bit mask
.equ CRCSCAN_ENABLE_bp = 0               ; Enable CRC scan bit position
.equ CRCSCAN_NMIEN_bm = 0x02             ; Enable NMI Trigger bit mask
.equ CRCSCAN_NMIEN_bp = 1                ; Enable NMI Trigger bit position
.equ CRCSCAN_RESET_bm = 0x80             ; Reset CRC scan bit mask
.equ CRCSCAN_RESET_bp = 7                ; Reset CRC scan bit position

; CRCSCAN_CTRLB masks
.equ CRCSCAN_SRC_gm = 0x03               ; CRC Source group mask
.equ CRCSCAN_SRC_gp = 0                  ; CRC Source group position
.equ CRCSCAN_SRC_0_bm = (1<<0)           ; CRC Source bit 0 mask
.equ CRCSCAN_SRC_0_bp = 0                ; CRC Source bit 0 position
.equ CRCSCAN_SRC_1_bm = (1<<1)           ; CRC Source bit 1 mask
.equ CRCSCAN_SRC_1_bp = 1                ; CRC Source bit 1 position

; CRCSCAN_STATUS masks
.equ CRCSCAN_BUSY_bm = 0x01              ; CRC Busy bit mask
.equ CRCSCAN_BUSY_bp = 0                 ; CRC Busy bit position
.equ CRCSCAN_OK_bm = 0x02                ; CRC Ok bit mask
.equ CRCSCAN_OK_bp = 1                   ; CRC Ok bit position

; CRC Source select
.equ CRCSCAN_SRC_FLASH_gc = (0x00<<0)    ; CRC on entire flash
.equ CRCSCAN_SRC_APPLICATION_gc = (0x01<<0) ; CRC on boot and appl section of flash
.equ CRCSCAN_SRC_BOOT_gc = (0x02<<0)     ; CRC on boot section of flash


;*************************************************************************
;** EVSYS - Event System
;*************************************************************************

; EVSYS_SWEVENTA masks
.equ EVSYS_SWEVENTA_gm = 0xFF            ; Software event on channel select group mask
.equ EVSYS_SWEVENTA_gp = 0               ; Software event on channel select group position
.equ EVSYS_SWEVENTA_0_bm = (1<<0)        ; Software event on channel select bit 0 mask
.equ EVSYS_SWEVENTA_0_bp = 0             ; Software event on channel select bit 0 position
.equ EVSYS_SWEVENTA_1_bm = (1<<1)        ; Software event on channel select bit 1 mask
.equ EVSYS_SWEVENTA_1_bp = 1             ; Software event on channel select bit 1 position
.equ EVSYS_SWEVENTA_2_bm = (1<<2)        ; Software event on channel select bit 2 mask
.equ EVSYS_SWEVENTA_2_bp = 2             ; Software event on channel select bit 2 position
.equ EVSYS_SWEVENTA_3_bm = (1<<3)        ; Software event on channel select bit 3 mask
.equ EVSYS_SWEVENTA_3_bp = 3             ; Software event on channel select bit 3 position
.equ EVSYS_SWEVENTA_4_bm = (1<<4)        ; Software event on channel select bit 4 mask
.equ EVSYS_SWEVENTA_4_bp = 4             ; Software event on channel select bit 4 position
.equ EVSYS_SWEVENTA_5_bm = (1<<5)        ; Software event on channel select bit 5 mask
.equ EVSYS_SWEVENTA_5_bp = 5             ; Software event on channel select bit 5 position
.equ EVSYS_SWEVENTA_6_bm = (1<<6)        ; Software event on channel select bit 6 mask
.equ EVSYS_SWEVENTA_6_bp = 6             ; Software event on channel select bit 6 position
.equ EVSYS_SWEVENTA_7_bm = (1<<7)        ; Software event on channel select bit 7 mask
.equ EVSYS_SWEVENTA_7_bp = 7             ; Software event on channel select bit 7 position

; EVSYS_CHANNEL0 masks
.equ EVSYS_CHANNEL_gm = 0xFF             ; Channel generator select group mask
.equ EVSYS_CHANNEL_gp = 0                ; Channel generator select group position
.equ EVSYS_CHANNEL_0_bm = (1<<0)         ; Channel generator select bit 0 mask
.equ EVSYS_CHANNEL_0_bp = 0              ; Channel generator select bit 0 position
.equ EVSYS_CHANNEL_1_bm = (1<<1)         ; Channel generator select bit 1 mask
.equ EVSYS_CHANNEL_1_bp = 1              ; Channel generator select bit 1 position
.equ EVSYS_CHANNEL_2_bm = (1<<2)         ; Channel generator select bit 2 mask
.equ EVSYS_CHANNEL_2_bp = 2              ; Channel generator select bit 2 position
.equ EVSYS_CHANNEL_3_bm = (1<<3)         ; Channel generator select bit 3 mask
.equ EVSYS_CHANNEL_3_bp = 3              ; Channel generator select bit 3 position
.equ EVSYS_CHANNEL_4_bm = (1<<4)         ; Channel generator select bit 4 mask
.equ EVSYS_CHANNEL_4_bp = 4              ; Channel generator select bit 4 position
.equ EVSYS_CHANNEL_5_bm = (1<<5)         ; Channel generator select bit 5 mask
.equ EVSYS_CHANNEL_5_bp = 5              ; Channel generator select bit 5 position
.equ EVSYS_CHANNEL_6_bm = (1<<6)         ; Channel generator select bit 6 mask
.equ EVSYS_CHANNEL_6_bp = 6              ; Channel generator select bit 6 position
.equ EVSYS_CHANNEL_7_bm = (1<<7)         ; Channel generator select bit 7 mask
.equ EVSYS_CHANNEL_7_bp = 7              ; Channel generator select bit 7 position

; EVSYS_CHANNEL1 masks
; Masks for EVSYS_CHANNEL already defined

; EVSYS_CHANNEL2 masks
; Masks for EVSYS_CHANNEL already defined

; EVSYS_CHANNEL3 masks
; Masks for EVSYS_CHANNEL already defined

; EVSYS_CHANNEL4 masks
; Masks for EVSYS_CHANNEL already defined

; EVSYS_CHANNEL5 masks
; Masks for EVSYS_CHANNEL already defined

; EVSYS_USERCCLLUT0A masks
.equ EVSYS_USER_gm = 0xFF                ; User channel select group mask
.equ EVSYS_USER_gp = 0                   ; User channel select group position
.equ EVSYS_USER_0_bm = (1<<0)            ; User channel select bit 0 mask
.equ EVSYS_USER_0_bp = 0                 ; User channel select bit 0 position
.equ EVSYS_USER_1_bm = (1<<1)            ; User channel select bit 1 mask
.equ EVSYS_USER_1_bp = 1                 ; User channel select bit 1 position
.equ EVSYS_USER_2_bm = (1<<2)            ; User channel select bit 2 mask
.equ EVSYS_USER_2_bp = 2                 ; User channel select bit 2 position
.equ EVSYS_USER_3_bm = (1<<3)            ; User channel select bit 3 mask
.equ EVSYS_USER_3_bp = 3                 ; User channel select bit 3 position
.equ EVSYS_USER_4_bm = (1<<4)            ; User channel select bit 4 mask
.equ EVSYS_USER_4_bp = 4                 ; User channel select bit 4 position
.equ EVSYS_USER_5_bm = (1<<5)            ; User channel select bit 5 mask
.equ EVSYS_USER_5_bp = 5                 ; User channel select bit 5 position
.equ EVSYS_USER_6_bm = (1<<6)            ; User channel select bit 6 mask
.equ EVSYS_USER_6_bp = 6                 ; User channel select bit 6 position
.equ EVSYS_USER_7_bm = (1<<7)            ; User channel select bit 7 mask
.equ EVSYS_USER_7_bp = 7                 ; User channel select bit 7 position

; EVSYS_USERCCLLUT0B masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT1A masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT1B masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT2A masks
; Masks for EVSYS_USER already defined

