QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB28def.inc
; EVSYS_USERCCLLUT2B masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT3A masks
; Masks for EVSYS_USER already defined

; EVSYS_USERCCLLUT3B masks
; Masks for EVSYS_USER already defined

; EVSYS_USERADC0START masks
; Masks for EVSYS_USER already defined

; EVSYS_USEREVSYSEVOUTA masks
; Masks for EVSYS_USER already defined

; EVSYS_USEREVSYSEVOUTC masks
; Masks for EVSYS_USER already defined

; EVSYS_USEREVSYSEVOUTD masks
; Masks for EVSYS_USER already defined

; EVSYS_USEREVSYSEVOUTF masks
; Masks for EVSYS_USER already defined

; EVSYS_USERUSART0IRDA masks
; Masks for EVSYS_USER already defined

; EVSYS_USERTCE0CNTA masks
; Masks for EVSYS_USER already defined

; EVSYS_USERTCE0CNTB masks
; Masks for EVSYS_USER already defined

; EVSYS_USERTCB0CAPT masks
; Masks for EVSYS_USER already defined

; EVSYS_USERTCB0COUNT masks
; Masks for EVSYS_USER already defined

; EVSYS_USERTCB1CAPT masks
; Masks for EVSYS_USER already defined

; EVSYS_USERTCB1COUNT masks
; Masks for EVSYS_USER already defined

; EVSYS_USERTCF0CNT masks
; Masks for EVSYS_USER already defined

; EVSYS_USERTCF0ACT masks
; Masks for EVSYS_USER already defined

; EVSYS_USERWEXA masks
; Masks for EVSYS_USER already defined

; EVSYS_USERWEXB masks
; Masks for EVSYS_USER already defined

; EVSYS_USERWEXC masks
; Masks for EVSYS_USER already defined

; Channel generator select
.equ EVSYS_CHANNEL_OFF_gc = (0x00<<0)    ; Off
.equ EVSYS_CHANNEL_UPDI_SYNCH_gc = (0x01<<0) ; UPDI SYNCH character
.equ EVSYS_CHANNEL_RTC_OVF_gc = (0x06<<0) ; Real Time Counter overflow
.equ EVSYS_CHANNEL_RTC_CMP_gc = (0x07<<0) ; Real Time Counter compare
.equ EVSYS_CHANNEL_RTC_PITEV0_gc = (0x08<<0) ; Periodic Interrupt Timer Event 0
.equ EVSYS_CHANNEL_RTC_PITEV1_gc = (0x09<<0) ; Periodic Interrupt Timer Event 1
.equ EVSYS_CHANNEL_CCL_LUT0_gc = (0x10<<0) ; Configurable Custom Logic LUT0
.equ EVSYS_CHANNEL_CCL_LUT1_gc = (0x11<<0) ; Configurable Custom Logic LUT1
.equ EVSYS_CHANNEL_CCL_LUT2_gc = (0x12<<0) ; Configurable Custom Logic LUT2
.equ EVSYS_CHANNEL_CCL_LUT3_gc = (0x13<<0) ; Configurable Custom Logic LUT3
.equ EVSYS_CHANNEL_AC0_OUT_gc = (0x20<<0) ; Analog Comparator 0 out
.equ EVSYS_CHANNEL_AC1_OUT_gc = (0x21<<0) ; Analog Comparator 1 out
.equ EVSYS_CHANNEL_ADC0_RES_gc = (0x24<<0) ; ADC 0 Result Ready
.equ EVSYS_CHANNEL_ADC0_SAMP_gc = (0x25<<0) ; ADC 0 Sample Ready
.equ EVSYS_CHANNEL_ADC0_WCMP_gc = (0x26<<0) ; ADC 0 Window Compare
.equ EVSYS_CHANNEL_PORTA_EV0_gc = (0x40<<0) ; Port A Event 0
.equ EVSYS_CHANNEL_PORTA_EV1_gc = (0x41<<0) ; Port A Event 1
.equ EVSYS_CHANNEL_PORTC_EV0_gc = (0x44<<0) ; Port C Event 0
.equ EVSYS_CHANNEL_PORTC_EV1_gc = (0x45<<0) ; Port C Event 1
.equ EVSYS_CHANNEL_PORTD_EV0_gc = (0x46<<0) ; Port D Event 0
.equ EVSYS_CHANNEL_PORTD_EV1_gc = (0x47<<0) ; Port D Event 1
.equ EVSYS_CHANNEL_PORTF_EV0_gc = (0x4A<<0) ; Port F Event 0
.equ EVSYS_CHANNEL_PORTF_EV1_gc = (0x4B<<0) ; Port F Event 1
.equ EVSYS_CHANNEL_USART0_XCK_gc = (0x60<<0) ; USART 0 XCK
.equ EVSYS_CHANNEL_SPI0_SCK_gc = (0x68<<0) ; SPI 0 SCK
.equ EVSYS_CHANNEL_TCE0_OVF_gc = (0x80<<0) ; Timer/Counter E0 overflow
.equ EVSYS_CHANNEL_TCE0_CMP0_gc = (0x84<<0) ; Timer/Counter E0 compare 0
.equ EVSYS_CHANNEL_TCE0_CMP1_gc = (0x85<<0) ; Timer/Counter E0 compare 1
.equ EVSYS_CHANNEL_TCE0_CMP2_gc = (0x86<<0) ; Timer/Counter E0 compare 2
.equ EVSYS_CHANNEL_TCE0_CMP3_gc = (0x87<<0) ; Timer/Counter E0 compare 3
.equ EVSYS_CHANNEL_TCB0_CAPT_gc = (0xA0<<0) ; Timer/Counter B0 capture
.equ EVSYS_CHANNEL_TCB0_OVF_gc = (0xA1<<0) ; Timer/Counter B0 overflow
.equ EVSYS_CHANNEL_TCB1_CAPT_gc = (0xA2<<0) ; Timer/Counter B1 capture
.equ EVSYS_CHANNEL_TCB1_OVF_gc = (0xA3<<0) ; Timer/Counter B1 overflow
.equ EVSYS_CHANNEL_TCF0_OVF_gc = (0xB8<<0) ; Timer/Counter F0 Overflow
.equ EVSYS_CHANNEL_TCF0_CMP0_gc = (0xB9<<0) ; Timer/Counter F0 compare 0
.equ EVSYS_CHANNEL_TCF0_CMP1_gc = (0xBA<<0) ; Timer/Counter F0 compare 1

; Software event on channel select
.equ EVSYS_SWEVENTA_CH0_gc = (0x01<<0)   ; Software event on channel 0
.equ EVSYS_SWEVENTA_CH1_gc = (0x02<<0)   ; Software event on channel 1
.equ EVSYS_SWEVENTA_CH2_gc = (0x04<<0)   ; Software event on channel 2
.equ EVSYS_SWEVENTA_CH3_gc = (0x08<<0)   ; Software event on channel 3
.equ EVSYS_SWEVENTA_CH4_gc = (0x10<<0)   ; Software event on channel 4
.equ EVSYS_SWEVENTA_CH5_gc = (0x20<<0)   ; Software event on channel 5
.equ EVSYS_SWEVENTA_CH6_gc = (0x40<<0)   ; Software event on channel 6
.equ EVSYS_SWEVENTA_CH7_gc = (0x80<<0)   ; Software event on channel 7

; User channel select
.equ EVSYS_USER_OFF_gc = (0x00<<0)       ; Off, No Eventsys Channel connected
.equ EVSYS_USER_CHANNEL0_gc = (0x01<<0)  ; Connect user to event channel 0
.equ EVSYS_USER_CHANNEL1_gc = (0x02<<0)  ; Connect user to event channel 1
.equ EVSYS_USER_CHANNEL2_gc = (0x03<<0)  ; Connect user to event channel 2
.equ EVSYS_USER_CHANNEL3_gc = (0x04<<0)  ; Connect user to event channel 3
.equ EVSYS_USER_CHANNEL4_gc = (0x05<<0)  ; Connect user to event channel 4
.equ EVSYS_USER_CHANNEL5_gc = (0x06<<0)  ; Connect user to event channel 5


;*************************************************************************
;** FUSE - Fuses
;*************************************************************************

; FUSE_WDTCFG masks
.equ FUSE_PERIOD_gm = 0x0F               ; Watchdog Timeout Period group mask
.equ FUSE_PERIOD_gp = 0                  ; Watchdog Timeout Period group position
.equ FUSE_PERIOD_0_bm = (1<<0)           ; Watchdog Timeout Period bit 0 mask
.equ FUSE_PERIOD_0_bp = 0                ; Watchdog Timeout Period bit 0 position
.equ FUSE_PERIOD_1_bm = (1<<1)           ; Watchdog Timeout Period bit 1 mask
.equ FUSE_PERIOD_1_bp = 1                ; Watchdog Timeout Period bit 1 position
.equ FUSE_PERIOD_2_bm = (1<<2)           ; Watchdog Timeout Period bit 2 mask
.equ FUSE_PERIOD_2_bp = 2                ; Watchdog Timeout Period bit 2 position
.equ FUSE_PERIOD_3_bm = (1<<3)           ; Watchdog Timeout Period bit 3 mask
.equ FUSE_PERIOD_3_bp = 3                ; Watchdog Timeout Period bit 3 position
.equ FUSE_WINDOW_gm = 0xF0               ; Watchdog Window Timeout Period group mask
.equ FUSE_WINDOW_gp = 4                  ; Watchdog Window Timeout Period group position
.equ FUSE_WINDOW_0_bm = (1<<4)           ; Watchdog Window Timeout Period bit 0 mask
.equ FUSE_WINDOW_0_bp = 4                ; Watchdog Window Timeout Period bit 0 position
.equ FUSE_WINDOW_1_bm = (1<<5)           ; Watchdog Window Timeout Period bit 1 mask
.equ FUSE_WINDOW_1_bp = 5                ; Watchdog Window Timeout Period bit 1 position
.equ FUSE_WINDOW_2_bm = (1<<6)           ; Watchdog Window Timeout Period bit 2 mask
.equ FUSE_WINDOW_2_bp = 6                ; Watchdog Window Timeout Period bit 2 position
.equ FUSE_WINDOW_3_bm = (1<<7)           ; Watchdog Window Timeout Period bit 3 mask
.equ FUSE_WINDOW_3_bp = 7                ; Watchdog Window Timeout Period bit 3 position

