QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB28def.inc
; SYSCFG_REVID masks
.equ SYSCFG_MINOR_gm = 0x0F              ; Minor Revision group mask
.equ SYSCFG_MINOR_gp = 0                 ; Minor Revision group position
.equ SYSCFG_MINOR_0_bm = (1<<0)          ; Minor Revision bit 0 mask
.equ SYSCFG_MINOR_0_bp = 0               ; Minor Revision bit 0 position
.equ SYSCFG_MINOR_1_bm = (1<<1)          ; Minor Revision bit 1 mask
.equ SYSCFG_MINOR_1_bp = 1               ; Minor Revision bit 1 position
.equ SYSCFG_MINOR_2_bm = (1<<2)          ; Minor Revision bit 2 mask
.equ SYSCFG_MINOR_2_bp = 2               ; Minor Revision bit 2 position
.equ SYSCFG_MINOR_3_bm = (1<<3)          ; Minor Revision bit 3 mask
.equ SYSCFG_MINOR_3_bp = 3               ; Minor Revision bit 3 position
.equ SYSCFG_MAJOR_gm = 0xF0              ; Major Revision group mask
.equ SYSCFG_MAJOR_gp = 4                 ; Major Revision group position
.equ SYSCFG_MAJOR_0_bm = (1<<4)          ; Major Revision bit 0 mask
.equ SYSCFG_MAJOR_0_bp = 4               ; Major Revision bit 0 position
.equ SYSCFG_MAJOR_1_bm = (1<<5)          ; Major Revision bit 1 mask
.equ SYSCFG_MAJOR_1_bp = 5               ; Major Revision bit 1 position
.equ SYSCFG_MAJOR_2_bm = (1<<6)          ; Major Revision bit 2 mask
.equ SYSCFG_MAJOR_2_bp = 6               ; Major Revision bit 2 position
.equ SYSCFG_MAJOR_3_bm = (1<<7)          ; Major Revision bit 3 mask
.equ SYSCFG_MAJOR_3_bp = 7               ; Major Revision bit 3 position


;*************************************************************************
;** TCB - 16-bit Timer/Counter Type B
;*************************************************************************

; TCB_CTRLA masks
.equ TCB_ENABLE_bm = 0x01                ; Enable bit mask
.equ TCB_ENABLE_bp = 0                   ; Enable bit position
.equ TCB_CLKSEL_gm = 0x0E                ; Clock Select group mask
.equ TCB_CLKSEL_gp = 1                   ; Clock Select group position
.equ TCB_CLKSEL_0_bm = (1<<1)            ; Clock Select bit 0 mask
.equ TCB_CLKSEL_0_bp = 1                 ; Clock Select bit 0 position
.equ TCB_CLKSEL_1_bm = (1<<2)            ; Clock Select bit 1 mask
.equ TCB_CLKSEL_1_bp = 2                 ; Clock Select bit 1 position
.equ TCB_CLKSEL_2_bm = (1<<3)            ; Clock Select bit 2 mask
.equ TCB_CLKSEL_2_bp = 3                 ; Clock Select bit 2 position
.equ TCB_SYNCUPD_bm = 0x10               ; Synchronize Update bit mask
.equ TCB_SYNCUPD_bp = 4                  ; Synchronize Update bit position
.equ TCB_CASCADE_bm = 0x20               ; Cascade two timers bit mask
.equ TCB_CASCADE_bp = 5                  ; Cascade two timers bit position
.equ TCB_RUNSTDBY_bm = 0x40              ; Run Standby bit mask
.equ TCB_RUNSTDBY_bp = 6                 ; Run Standby bit position

; TCB_CTRLB masks
.equ TCB_CNTMODE_gm = 0x07               ; Timer Mode group mask
.equ TCB_CNTMODE_gp = 0                  ; Timer Mode group position
.equ TCB_CNTMODE_0_bm = (1<<0)           ; Timer Mode bit 0 mask
.equ TCB_CNTMODE_0_bp = 0                ; Timer Mode bit 0 position
.equ TCB_CNTMODE_1_bm = (1<<1)           ; Timer Mode bit 1 mask
.equ TCB_CNTMODE_1_bp = 1                ; Timer Mode bit 1 position
.equ TCB_CNTMODE_2_bm = (1<<2)           ; Timer Mode bit 2 mask
.equ TCB_CNTMODE_2_bp = 2                ; Timer Mode bit 2 position
.equ TCB_CCMPEN_bm = 0x10                ; Pin Output Enable bit mask
.equ TCB_CCMPEN_bp = 4                   ; Pin Output Enable bit position
.equ TCB_CCMPINIT_bm = 0x20              ; Pin Initial State bit mask
.equ TCB_CCMPINIT_bp = 5                 ; Pin Initial State bit position
.equ TCB_ASYNC_bm = 0x40                 ; Asynchronous Enable bit mask
.equ TCB_ASYNC_bp = 6                    ; Asynchronous Enable bit position
.equ TCB_EVGEN_bm = 0x80                 ; Event Generation bit mask
.equ TCB_EVGEN_bp = 7                    ; Event Generation bit position

; TCB_CTRLC masks
.equ TCB_CNTSIZE_gm = 0x07               ; Counter Size group mask
.equ TCB_CNTSIZE_gp = 0                  ; Counter Size group position
.equ TCB_CNTSIZE_0_bm = (1<<0)           ; Counter Size bit 0 mask
.equ TCB_CNTSIZE_0_bp = 0                ; Counter Size bit 0 position
.equ TCB_CNTSIZE_1_bm = (1<<1)           ; Counter Size bit 1 mask
.equ TCB_CNTSIZE_1_bp = 1                ; Counter Size bit 1 position
.equ TCB_CNTSIZE_2_bm = (1<<2)           ; Counter Size bit 2 mask
.equ TCB_CNTSIZE_2_bp = 2                ; Counter Size bit 2 position

; TCB_EVCTRL masks
.equ TCB_CAPTEI_bm = 0x01                ; Event Input Enable bit mask
.equ TCB_CAPTEI_bp = 0                   ; Event Input Enable bit position
.equ TCB_EDGE_bm = 0x10                  ; Event Edge bit mask
.equ TCB_EDGE_bp = 4                     ; Event Edge bit position
.equ TCB_FILTER_bm = 0x40                ; Input Capture Noise Cancellation Filter bit mask
.equ TCB_FILTER_bp = 6                   ; Input Capture Noise Cancellation Filter bit position

; TCB_INTCTRL masks
.equ TCB_CAPT_bm = 0x01                  ; Capture or Timeout bit mask
.equ TCB_CAPT_bp = 0                     ; Capture or Timeout bit position
.equ TCB_OVF_bm = 0x02                   ; Overflow bit mask
.equ TCB_OVF_bp = 1                      ; Overflow bit position

; TCB_INTFLAGS masks
; Masks for TCB_CAPT already defined
; Masks for TCB_OVF already defined

; TCB_STATUS masks
.equ TCB_RUN_bm = 0x01                   ; Run bit mask
.equ TCB_RUN_bp = 0                      ; Run bit position

; TCB_DBGCTRL masks
.equ TCB_DBGRUN_bm = 0x01                ; Debug Run bit mask
.equ TCB_DBGRUN_bp = 0                   ; Debug Run bit position

; Clock Select
.equ TCB_CLKSEL_DIV1_gc = (0x00<<1)      ; CLK_PER
.equ TCB_CLKSEL_DIV2_gc = (0x01<<1)      ; CLK_PER/2
.equ TCB_CLKSEL_TCE0_gc = (0x02<<1)      ; Use CLK_TCE from TCE0
.equ TCB_CLKSEL_EVENT_gc = (0x07<<1)     ; Count on event edge

; Timer Mode select
.equ TCB_CNTMODE_INT_gc = (0x00<<0)      ; Periodic Interrupt
.equ TCB_CNTMODE_TIMEOUT_gc = (0x01<<0)  ; Periodic Timeout
.equ TCB_CNTMODE_CAPT_gc = (0x02<<0)     ; Input Capture Event
.equ TCB_CNTMODE_FRQ_gc = (0x03<<0)      ; Input Capture Frequency measurement
.equ TCB_CNTMODE_PW_gc = (0x04<<0)       ; Input Capture Pulse-Width measurement
.equ TCB_CNTMODE_FRQPW_gc = (0x05<<0)    ; Input Capture Frequency and Pulse-Width measurement
.equ TCB_CNTMODE_SINGLE_gc = (0x06<<0)   ; Single Shot
.equ TCB_CNTMODE_PWM8_gc = (0x07<<0)     ; 8-bit PWM

; Event Generation select
.equ TCB_EVGEN_PULSE_gc = (0x00<<7)      ; Event is generated as pulse at compare match or capture
.equ TCB_EVGEN_WAVEFORM_gc = (0x01<<7)   ; Event is generated as waveform for modes with waveform

; Counter Size select
.equ TCB_CNTSIZE_16BITS_gc = (0x00<<0)   ; 16-bit CNT. MAX=16'hFFFF
.equ TCB_CNTSIZE_15BITS_gc = (0x01<<0)   ; 15-bit CNT. MAX=16'h7FFF
.equ TCB_CNTSIZE_14BITS_gc = (0x02<<0)   ; 14-bit CNT. MAX=16'h3FFF
.equ TCB_CNTSIZE_13BITS_gc = (0x03<<0)   ; 13-bit CNT. MAX=16'h1FFF
.equ TCB_CNTSIZE_12BITS_gc = (0x04<<0)   ; 12-bit CNT. MAX=16'h0FFF
.equ TCB_CNTSIZE_11BITS_gc = (0x05<<0)   ; 11-bit CNT. MAX=16'h07FF
.equ TCB_CNTSIZE_10BITS_gc = (0x06<<0)   ; 10-bit CNT. MAX=16'h03FF
.equ TCB_CNTSIZE_9BITS_gc = (0x07<<0)    ; 9-bit CNT. MAX=16'h01FF


;*************************************************************************
;** TCE - 16-bit Timer/Counter Type E
;*************************************************************************

; TCE_CTRLA masks
.equ TCE_ENABLE_bm = 0x01                ; Module Enable bit mask
.equ TCE_ENABLE_bp = 0                   ; Module Enable bit position
.equ TCE_CLKSEL_gm = 0x0E                ; Clock Selection group mask
.equ TCE_CLKSEL_gp = 1                   ; Clock Selection group position
.equ TCE_CLKSEL_0_bm = (1<<1)            ; Clock Selection bit 0 mask
.equ TCE_CLKSEL_0_bp = 1                 ; Clock Selection bit 0 position
.equ TCE_CLKSEL_1_bm = (1<<2)            ; Clock Selection bit 1 mask
.equ TCE_CLKSEL_1_bp = 2                 ; Clock Selection bit 1 position
.equ TCE_CLKSEL_2_bm = (1<<3)            ; Clock Selection bit 2 mask
.equ TCE_CLKSEL_2_bp = 3                 ; Clock Selection bit 2 position
.equ TCE_RUNSTDBY_bm = 0x80              ; Run in Standby bit mask
.equ TCE_RUNSTDBY_bp = 7                 ; Run in Standby bit position

; TCE_CTRLB masks
.equ TCE_WGMODE_gm = 0x07                ; Waveform generation mode group mask
.equ TCE_WGMODE_gp = 0                   ; Waveform generation mode group position
.equ TCE_WGMODE_0_bm = (1<<0)            ; Waveform generation mode bit 0 mask
.equ TCE_WGMODE_0_bp = 0                 ; Waveform generation mode bit 0 position
.equ TCE_WGMODE_1_bm = (1<<1)            ; Waveform generation mode bit 1 mask
.equ TCE_WGMODE_1_bp = 1                 ; Waveform generation mode bit 1 position
.equ TCE_WGMODE_2_bm = (1<<2)            ; Waveform generation mode bit 2 mask
.equ TCE_WGMODE_2_bp = 2                 ; Waveform generation mode bit 2 position
.equ TCE_ALUPD_bm = 0x08                 ; Auto Lock Update bit mask
.equ TCE_ALUPD_bp = 3                    ; Auto Lock Update bit position
.equ TCE_CMP0EN_bm = 0x10                ; Compare 0 Enable bit mask
.equ TCE_CMP0EN_bp = 4                   ; Compare 0 Enable bit position
.equ TCE_CMP1EN_bm = 0x20                ; Compare 1 Enable bit mask
.equ TCE_CMP1EN_bp = 5                   ; Compare 1 Enable bit position
.equ TCE_CMP2EN_bm = 0x40                ; Compare 2 Enable bit mask
.equ TCE_CMP2EN_bp = 6                   ; Compare 2 Enable bit position
.equ TCE_CMP3EN_bm = 0x80                ; Compare 3 Enable bit mask
.equ TCE_CMP3EN_bp = 7                   ; Compare 3 Enable bit position

; TCE_CTRLC masks
.equ TCE_CMP0OV_bm = 0x01                ; Compare 0 Waveform Output Value bit mask
.equ TCE_CMP0OV_bp = 0                   ; Compare 0 Waveform Output Value bit position
.equ TCE_CMP1OV_bm = 0x02                ; Compare 1 Waveform Output Value bit mask
.equ TCE_CMP1OV_bp = 1                   ; Compare 1 Waveform Output Value bit position
.equ TCE_CMP2OV_bm = 0x04                ; Compare 2 Waveform Output Value bit mask
.equ TCE_CMP2OV_bp = 2                   ; Compare 2 Waveform Output Value bit position
.equ TCE_CMP3OV_bm = 0x08                ; Compare 3 Waveform Output Value bit mask
.equ TCE_CMP3OV_bp = 3                   ; Compare 3 Waveform Output Value bit position
.equ TCE_CMP0POL_bm = 0x10               ; Compare 0 Polarity bit mask
.equ TCE_CMP0POL_bp = 4                  ; Compare 0 Polarity bit position
.equ TCE_CMP1POL_bm = 0x20               ; Compare 1 Polarity bit mask
.equ TCE_CMP1POL_bp = 5                  ; Compare 1 Polarity bit position
.equ TCE_CMP2POL_bm = 0x40               ; Compare 2 Polarity bit mask
.equ TCE_CMP2POL_bp = 6                  ; Compare 2 Polarity bit position
.equ TCE_CMP3POL_bm = 0x80               ; Compare 3 Polarity bit mask
.equ TCE_CMP3POL_bp = 7                  ; Compare 3 Polarity bit position

