QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB28def.inc
; TCF_CTRLC masks
.equ TCF_WO0EN_bm = 0x01                 ; Waveform Output 0 Enable bit mask
.equ TCF_WO0EN_bp = 0                    ; Waveform Output 0 Enable bit position
.equ TCF_WO1EN_bm = 0x02                 ; Waveform Output 1 Enable bit mask
.equ TCF_WO1EN_bp = 1                    ; Waveform Output 1 Enable bit position
.equ TCF_WO0POL_bm = 0x04                ; Waveform Output 0 Polarity bit mask
.equ TCF_WO0POL_bp = 2                   ; Waveform Output 0 Polarity bit position
.equ TCF_WO1POL_bm = 0x08                ; Waveform Output 1 Polarity bit mask
.equ TCF_WO1POL_bp = 3                   ; Waveform Output 1 Polarity bit position
.equ TCF_WGPULSE_gm = 0x70               ; Waveform Generation Pulse Length group mask
.equ TCF_WGPULSE_gp = 4                  ; Waveform Generation Pulse Length group position
.equ TCF_WGPULSE_0_bm = (1<<4)           ; Waveform Generation Pulse Length bit 0 mask
.equ TCF_WGPULSE_0_bp = 4                ; Waveform Generation Pulse Length bit 0 position
.equ TCF_WGPULSE_1_bm = (1<<5)           ; Waveform Generation Pulse Length bit 1 mask
.equ TCF_WGPULSE_1_bp = 5                ; Waveform Generation Pulse Length bit 1 position
.equ TCF_WGPULSE_2_bm = (1<<6)           ; Waveform Generation Pulse Length bit 2 mask
.equ TCF_WGPULSE_2_bp = 6                ; Waveform Generation Pulse Length bit 2 position

; TCF_CTRLD masks
.equ TCF_CMD_gm = 0x03                   ; Command group mask
.equ TCF_CMD_gp = 0                      ; Command group position
.equ TCF_CMD_0_bm = (1<<0)               ; Command bit 0 mask
.equ TCF_CMD_0_bp = 0                    ; Command bit 0 position
.equ TCF_CMD_1_bm = (1<<1)               ; Command bit 1 mask
.equ TCF_CMD_1_bp = 1                    ; Command bit 1 position

; TCF_EVCTRL masks
.equ TCF_CNTAEI_bm = 0x01                ; Event A Input Enable bit mask
.equ TCF_CNTAEI_bp = 0                   ; Event A Input Enable bit position
.equ TCF_EVACTA_gm = 0x06                ; Event Action A group mask
.equ TCF_EVACTA_gp = 1                   ; Event Action A group position
.equ TCF_EVACTA_0_bm = (1<<1)            ; Event Action A bit 0 mask
.equ TCF_EVACTA_0_bp = 1                 ; Event Action A bit 0 position
.equ TCF_EVACTA_1_bm = (1<<2)            ; Event Action A bit 1 mask
.equ TCF_EVACTA_1_bp = 2                 ; Event Action A bit 1 position
.equ TCF_FILTERA_bm = 0x08               ; Event A Filter bit mask
.equ TCF_FILTERA_bp = 3                  ; Event A Filter bit position

; TCF_INTCTRL masks
.equ TCF_OVF_bm = 0x01                   ; Overflow bit mask
.equ TCF_OVF_bp = 0                      ; Overflow bit position
.equ TCF_CMP0_bm = 0x02                  ; Compare 0 Interrupt Enable bit mask
.equ TCF_CMP0_bp = 1                     ; Compare 0 Interrupt Enable bit position
.equ TCF_CMP1_bm = 0x04                  ; Compare 1 Interrupt Enable bit mask
.equ TCF_CMP1_bp = 2                     ; Compare 1 Interrupt Enable bit position

; TCF_INTFLAGS masks
; Masks for TCF_OVF already defined
; Masks for TCF_CMP0 already defined
; Masks for TCF_CMP1 already defined

; TCF_STATUS masks
.equ TCF_CTRLABUSY_bm = 0x02             ; Control A Synchronization Busy bit mask
.equ TCF_CTRLABUSY_bp = 1                ; Control A Synchronization Busy bit position
.equ TCF_CTRLCBUSY_bm = 0x04             ; Control B Synchronization Busy bit mask
.equ TCF_CTRLCBUSY_bp = 2                ; Control B Synchronization Busy bit position
.equ TCF_CTRLDBUSY_bm = 0x08             ; Control D Synchronization Busy bit mask
.equ TCF_CTRLDBUSY_bp = 3                ; Control D Synchronization Busy bit position
.equ TCF_CNTBUSY_bm = 0x10               ; Counter Synchronization Busy bit mask
.equ TCF_CNTBUSY_bp = 4                  ; Counter Synchronization Busy bit position
.equ TCF_PERBUSY_bm = 0x20               ; Period Synchronization Busy bit mask
.equ TCF_PERBUSY_bp = 5                  ; Period Synchronization Busy bit position
.equ TCF_CMP0BUSY_bm = 0x40              ; Compare 0 Synchronization Busy bit mask
.equ TCF_CMP0BUSY_bp = 6                 ; Compare 0 Synchronization Busy bit position
.equ TCF_CMP1BUSY_bm = 0x80              ; Compare 1 Synchronization Busy bit mask
.equ TCF_CMP1BUSY_bp = 7                 ; Compare 1 Synchronization Busy bit position

; TCF_DBGCTRL masks
.equ TCF_DBGRUN_bm = 0x01                ; Debug Run bit mask
.equ TCF_DBGRUN_bp = 0                   ; Debug Run bit position

; TCF_CNT masks
.equ TCF_CNT_gm = 0xFFFFFF               ; Counter group mask
.equ TCF_CNT_gp = 0                      ; Counter group position
.equ TCF_CNT_0_bm = (1<<0)               ; Counter bit 0 mask
.equ TCF_CNT_0_bp = 0                    ; Counter bit 0 position
.equ TCF_CNT_1_bm = (1<<1)               ; Counter bit 1 mask
.equ TCF_CNT_1_bp = 1                    ; Counter bit 1 position
.equ TCF_CNT_2_bm = (1<<2)               ; Counter bit 2 mask
.equ TCF_CNT_2_bp = 2                    ; Counter bit 2 position
.equ TCF_CNT_3_bm = (1<<3)               ; Counter bit 3 mask
.equ TCF_CNT_3_bp = 3                    ; Counter bit 3 position
.equ TCF_CNT_4_bm = (1<<4)               ; Counter bit 4 mask
.equ TCF_CNT_4_bp = 4                    ; Counter bit 4 position
.equ TCF_CNT_5_bm = (1<<5)               ; Counter bit 5 mask
.equ TCF_CNT_5_bp = 5                    ; Counter bit 5 position
.equ TCF_CNT_6_bm = (1<<6)               ; Counter bit 6 mask
.equ TCF_CNT_6_bp = 6                    ; Counter bit 6 position
.equ TCF_CNT_7_bm = (1<<7)               ; Counter bit 7 mask
.equ TCF_CNT_7_bp = 7                    ; Counter bit 7 position
.equ TCF_CNT_8_bm = (1<<8)               ; Counter bit 8 mask
.equ TCF_CNT_8_bp = 8                    ; Counter bit 8 position
.equ TCF_CNT_9_bm = (1<<9)               ; Counter bit 9 mask
.equ TCF_CNT_9_bp = 9                    ; Counter bit 9 position
.equ TCF_CNT_10_bm = (1<<10)             ; Counter bit 10 mask
.equ TCF_CNT_10_bp = 10                  ; Counter bit 10 position
.equ TCF_CNT_11_bm = (1<<11)             ; Counter bit 11 mask
.equ TCF_CNT_11_bp = 11                  ; Counter bit 11 position
.equ TCF_CNT_12_bm = (1<<12)             ; Counter bit 12 mask
.equ TCF_CNT_12_bp = 12                  ; Counter bit 12 position
.equ TCF_CNT_13_bm = (1<<13)             ; Counter bit 13 mask
.equ TCF_CNT_13_bp = 13                  ; Counter bit 13 position
.equ TCF_CNT_14_bm = (1<<14)             ; Counter bit 14 mask
.equ TCF_CNT_14_bp = 14                  ; Counter bit 14 position
.equ TCF_CNT_15_bm = (1<<15)             ; Counter bit 15 mask
.equ TCF_CNT_15_bp = 15                  ; Counter bit 15 position
.equ TCF_CNT_16_bm = (1<<16)             ; Counter bit 16 mask
.equ TCF_CNT_16_bp = 16                  ; Counter bit 16 position
.equ TCF_CNT_17_bm = (1<<17)             ; Counter bit 17 mask
.equ TCF_CNT_17_bp = 17                  ; Counter bit 17 position
.equ TCF_CNT_18_bm = (1<<18)             ; Counter bit 18 mask
.equ TCF_CNT_18_bp = 18                  ; Counter bit 18 position
.equ TCF_CNT_19_bm = (1<<19)             ; Counter bit 19 mask
.equ TCF_CNT_19_bp = 19                  ; Counter bit 19 position
.equ TCF_CNT_20_bm = (1<<20)             ; Counter bit 20 mask
.equ TCF_CNT_20_bp = 20                  ; Counter bit 20 position
.equ TCF_CNT_21_bm = (1<<21)             ; Counter bit 21 mask
.equ TCF_CNT_21_bp = 21                  ; Counter bit 21 position
.equ TCF_CNT_22_bm = (1<<22)             ; Counter bit 22 mask
.equ TCF_CNT_22_bp = 22                  ; Counter bit 22 position
.equ TCF_CNT_23_bm = (1<<23)             ; Counter bit 23 mask
.equ TCF_CNT_23_bp = 23                  ; Counter bit 23 position

